In [3]:
import pandas as pd
import numpy as np
%matplotlib inline

In [4]:
df = pd.read_csv('../data/sales_history.csv', index_col='日付', parse_dates=True)
test = pd.read_csv('../data/test.csv',index_col=0)

In [5]:
df.head()

            店舗ID     商品ID  商品価格  売上個数
日付
2018-01-01     9  1000001   420   1.0
2018-01-01     6  1000001   420   1.0
2018-01-01    10  1000001   420   1.0
2018-01-01     0  1000017   250   1.0
2018-01-01     1  1000017   250   1.0

In [46]:
df.tail()

            shop_id       id  price  quantity
日付
2019-10-31        0  3200026    850       1.0
2019-10-31       10  3300001   2040       1.0
2019-10-31       15  3400002   1440       1.0
2019-10-31       17  3400003   1190       1.0
2019-10-31        4  3500001    340       1.0

In [6]:
test.columns = 'id shop_id'.split()

In [7]:
df.columns = 'shop_id id price quantity'.split()

In [8]:
df.columns

Index(['shop_id', 'id', 'price', 'quantity'], dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1119570 entries, 2018-01-01 to 2019-10-31
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   shop_id   1119570 non-null  int64
 1   id        1119570 non-null  int64
 2   price     1119570 non-null  int64
 3   quantity  1119570 non-null  float64
dtypes: float64(1), int64(3)
memory usage: 42.7 MB

In [10]:
df = df[df['id'].isin(test['id'])]

In [43]:
monthly_sold = df.groupby(['shop_id','id']).resample(rule="M").agg({'price': 'mean', 'quantity': 'sum'})

In [44]:
monthly_sold.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 42198 entries, (0, 1000001, Timestamp('2018-01-31 00:00:00')) to (17, 3500001, Timestamp('2018-12-31 00:00:00'))
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   price     25407 non-null  float64
 1   quantity  42198 non-null  float64
dtypes: float64(2)
memory usage: 826.0 KB

In [48]:
monthly_sold[22:44]

                                 price  quantity
shop_id id      日付
0       1000001 2018-01-31  420.000000       6.0
                2018-02-28  356.666667       3.0
                2018-03-31  420.000000       1.0
                2018-04-30  420.000000       2.0
                2018-05-31         NaN       0.0
...                                ...       ...
        1000011 2019-02-28  250.000000       1.0
                2019-03-31  250.000000       1.0
                2019-04-30  250.000000       1.0
                2019-05-31         NaN       0.0
                2019-06-30  250.000000       1.0

[200 rows x 2 columns]

In [25]:
def month_cnt(date):
    for i in date:
        if i >= '2018-01-01' and i < '2018-02-01':
            return 0
        elif i >= '2018-02-01' and i < '2018-03-01':
            return 1
        else:
            return 4

In [17]:
month_cnt('2018-02-01')

1

In [20]:
df.index

DatetimeIndex(['2018-01-01', '2018-01-01', '2018-01-01', '2018-01-01',
               '2018-01-01', '2018-01-01', '2018-01-01', '2018-01-01',
               '2018-01-01', '2018-01-01',
               ...
               '2019-10-31', '2019-10-31', '2019-10-31', '2019-10-31',
               '2019-10-31', '2019-10-31', '2019-10-31', '2019-10-31',
               '2019-10-31', '2019-10-31'],
              dtype='datetime64[ns]', name='日付', length=48221, freq=None)

In [21]:
df.head()

            shop_id       id  price  quantity
日付
2018-01-01        9  1000001    420       1.0
2018-01-01        6  1000001    420       1.0
2018-01-01       10  1000001    420       1.0
2018-01-01        0  1200007    250       1.0
2018-01-01       15  1200007    130       1.0